## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization  | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

_**Hint:** If "Terraform Format & Style" failed, run `terraform fmt -recursive` from the `terraform/` directory and commit the results._

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-   destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_ecs_service.console will be updated in-place
  ~ resource "aws_ecs_service" "console" {
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/cpfreporter/cpfreporter-console"
        name                               = "cpfreporter-console"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:47" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.console must be replaced
+/- resource "aws_ecs_task_definition" "console" {
      ~ arn                      = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:47" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image                  = "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:5847534b0f6f90c95d741246ae1644798fb35c6b794b885579507e2da059003d" -> "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:17ea0d2f8e47bc236e4ceba230f6a9c754431d8aff951cccfbe25a988639a322"
-                   mountPoints            = []
                    name                   = "console"
-                   portMappings           = []
-                   volumesFrom            = []
                    # (7 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "cpfreporter-console" -> (known after apply)
      ~ revision                 = 47 -> (known after apply)
-       tags                     = {} -> null
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_s3_object.lambda_artifact-cpfValidation must be replaced
-/+ resource "aws_s3_object" "lambda_artifact-cpfValidation" {
+       acl                    = (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "941a24008125db82f9a3944a10abe9e9-5" -> "ac5123602e6ca54dfe711dccded70004"
      ~ id                     = "cpfValidation.03f26d9515a21efcc51fb0dc9cc27268.zip" -> (known after apply)
      ~ key                    = "cpfValidation.03f26d9515a21efcc51fb0dc9cc27268.zip" -> "cpfValidation.ac5123602e6ca54dfe711dccded70004.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source_hash            = "03f26d9515a21efcc51fb0dc9cc27268" -> "ac5123602e6ca54dfe711dccded70004"
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "g9kQdT0WeMMGZAeuIxfO2CAcKkvvXKXi" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-excelToJson must be replaced
-/+ resource "aws_s3_object" "lambda_artifact-excelToJson" {
+       acl                    = (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "b08aae30188b2349c62ad4146d6e4e5c-6" -> "0bb9e449d8f94dcd52dcf474560e69bc"
      ~ id                     = "excelToJson.f12d747e0b78b872f335428cbff9a31b.zip" -> (known after apply)
      ~ key                    = "excelToJson.f12d747e0b78b872f335428cbff9a31b.zip" -> "excelToJson.0bb9e449d8f94dcd52dcf474560e69bc.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source_hash            = "f12d747e0b78b872f335428cbff9a31b" -> "0bb9e449d8f94dcd52dcf474560e69bc"
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "RzAumkbeVS9xG5oooTNri_K7qguXpsBR" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-graphql must be replaced
+/- resource "aws_s3_object" "lambda_artifact-graphql" {
+       acl                    = (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "68740da25ff78d9a2f279da657d816d7-6" -> "dc23bf2a4003c73c9f5cd9a7a392fe28"
      ~ id                     = "graphql.1e50aff424afada973d824af9d2a113f.zip" -> (known after apply)
      ~ key                    = "graphql.1e50aff424afada973d824af9d2a113f.zip" -> "graphql.dc23bf2a4003c73c9f5cd9a7a392fe28.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source_hash            = "1e50aff424afada973d824af9d2a113f" -> "dc23bf2a4003c73c9f5cd9a7a392fe28"
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "czZVrmDpT37jYmjRDBm2IMYidNxds_HG" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["200.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "484a8ffcfdca848da043aca72bde7f25" -> "ed695e31b9e739399c5c4ffc7941a722"
        id                     = "dist/200.html"
      ~ source_hash            = "484a8ffcfdca848da043aca72bde7f25" -> "ed695e31b9e739399c5c4ffc7941a722"
        tags                   = {}
      ~ version_id             = "TaAy.gSKAa1H2p5NptEhVnRR6NCDzMM4" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["build-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "97ccf3682998cbfe851d1ddc6f87f6b6" -> "3886b9b2841e2124f0fea879c3070e43"
        id                     = "dist/build-manifest.json"
      ~ source_hash            = "97ccf3682998cbfe851d1ddc6f87f6b6" -> "3886b9b2841e2124f0fea879c3070e43"
        tags                   = {}
      ~ version_id             = ".SJVZNbtcj3Cc4cNxHm2QqXe8pnaKe5r" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["chunk-references.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "cdbe81da4d43d288fe36724ced658a13" -> "165ee22c372ba162f23e00448a5680ca"
        id                     = "dist/chunk-references.json"
      ~ source_hash            = "cdbe81da4d43d288fe36724ced658a13" -> "165ee22c372ba162f23e00448a5680ca"
        tags                   = {}
      ~ version_id             = "3LFbfr9UXl4ESqXnZVv3WhiaBTEkHrJf" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "484a8ffcfdca848da043aca72bde7f25" -> "ed695e31b9e739399c5c4ffc7941a722"
        id                     = "dist/index.html"
      ~ source_hash            = "484a8ffcfdca848da043aca72bde7f25" -> "ed695e31b9e739399c5c4ffc7941a722"
        tags                   = {}
      ~ version_id             = "wVNVpURkOn8WiXl1ccH.58ANL1jP8drS" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/UserEditUserPage.940783cb.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "47daebe8befef780b94941fd05073a61"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/UserEditUserPage.940783cb.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UserEditUserPage.940783cb.chunk.js"
+       source_hash            = "47daebe8befef780b94941fd05073a61"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/UserEditUserPage.940783cb.chunk.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "63401d07fb99a2c1ff4404567f6b3ec5"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/UserEditUserPage.940783cb.chunk.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UserEditUserPage.940783cb.chunk.js.LICENSE.txt"
+       source_hash            = "63401d07fb99a2c1ff4404567f6b3ec5"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/UserEditUserPage.cc722f7f.chunk.js"] will be destroyed
  # (because key ["static/js/UserEditUserPage.cc722f7f.chunk.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "e41a01dd54a3e9023b638528bcb2bfa6" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/UserEditUserPage.cc722f7f.chunk.js" -> null
-       key                    = "dist/static/js/UserEditUserPage.cc722f7f.chunk.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UserEditUserPage.cc722f7f.chunk.js" -> null
-       source_hash            = "e41a01dd54a3e9023b638528bcb2bfa6" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "735GvB5HPmgDpPqZa6HZfurhcw27AzDl" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/UserEditUserPage.cc722f7f.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/UserEditUserPage.cc722f7f.chunk.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "63401d07fb99a2c1ff4404567f6b3ec5" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/UserEditUserPage.cc722f7f.chunk.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/UserEditUserPage.cc722f7f.chunk.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UserEditUserPage.cc722f7f.chunk.js.LICENSE.txt" -> null
-       source_hash            = "63401d07fb99a2c1ff4404567f6b3ec5" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "WRgdou6baMt.Vl5N6PFJLxbD_._2TaDe" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/UserUserPage.3ea50811.chunk.js"] will be destroyed
  # (because key ["static/js/UserUserPage.3ea50811.chunk.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "73837c005b0951b2e04e665e6201bc30" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/UserUserPage.3ea50811.chunk.js" -> null
-       key                    = "dist/static/js/UserUserPage.3ea50811.chunk.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UserUserPage.3ea50811.chunk.js" -> null
-       source_hash            = "73837c005b0951b2e04e665e6201bc30" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "55IXliC3xJ6GtzBrjiQ1Ee4SvSuDyYpG" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/UserUserPage.3ea50811.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/UserUserPage.3ea50811.chunk.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "1759e5d7fb4b61a7afc4291ec777e7f1" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/UserUserPage.3ea50811.chunk.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/UserUserPage.3ea50811.chunk.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UserUserPage.3ea50811.chunk.js.LICENSE.txt" -> null
-       source_hash            = "1759e5d7fb4b61a7afc4291ec777e7f1" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "K22l2fYB_3302F5yeT2pg8lRfgJpVIKu" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/UserUserPage.458afe17.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "b87eb231bc4ee58b3cdcac97b039be1d"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/UserUserPage.458afe17.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UserUserPage.458afe17.chunk.js"
+       source_hash            = "b87eb231bc4ee58b3cdcac97b039be1d"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/UserUserPage.458afe17.chunk.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "1759e5d7fb4b61a7afc4291ec777e7f1"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/UserUserPage.458afe17.chunk.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UserUserPage.458afe17.chunk.js.LICENSE.txt"
+       source_hash            = "1759e5d7fb4b61a7afc4291ec777e7f1"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/UserUsersPage.3397dcad.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "9dcf7264fb9b1aa9ba16187b0df41617"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/UserUsersPage.3397dcad.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UserUsersPage.3397dcad.chunk.js"
+       source_hash            = "9dcf7264fb9b1aa9ba16187b0df41617"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/UserUsersPage.3397dcad.chunk.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "c6fdde5760bf5d008d4ac72ddd13b210"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/UserUsersPage.3397dcad.chunk.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UserUsersPage.3397dcad.chunk.js.LICENSE.txt"
+       source_hash            = "c6fdde5760bf5d008d4ac72ddd13b210"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/UserUsersPage.80c817aa.chunk.js"] will be destroyed
  # (because key ["static/js/UserUsersPage.80c817aa.chunk.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "d8f1725f33054825ed74028a8031c26b" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/UserUsersPage.80c817aa.chunk.js" -> null
-       key                    = "dist/static/js/UserUsersPage.80c817aa.chunk.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UserUsersPage.80c817aa.chunk.js" -> null
-       source_hash            = "d8f1725f33054825ed74028a8031c26b" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "oTXn.ORkVorpn7d00gPM5ydwodFWROrK" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/UserUsersPage.80c817aa.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/UserUsersPage.80c817aa.chunk.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "c6fdde5760bf5d008d4ac72ddd13b210" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/UserUsersPage.80c817aa.chunk.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/UserUsersPage.80c817aa.chunk.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UserUsersPage.80c817aa.chunk.js.LICENSE.txt" -> null
-       source_hash            = "c6fdde5760bf5d008d4ac72ddd13b210" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "tfYDr_uMLh6z6dsAkFPiYfzUDRFfchuq" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.1da0dff4.js"] will be destroyed
  # (because key ["static/js/app.1da0dff4.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "efba588130d89b790944c37f133dd5b3" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.1da0dff4.js" -> null
-       key                    = "dist/static/js/app.1da0dff4.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.1da0dff4.js" -> null
-       source_hash            = "efba588130d89b790944c37f133dd5b3" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "g3r2vA9iuuq8zcqt3wi.aMBemyTgc7xH" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.1da0dff4.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/app.1da0dff4.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "9806104531a6dc74425d37448a95fecc" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.1da0dff4.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/app.1da0dff4.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.1da0dff4.js.LICENSE.txt" -> null
-       source_hash            = "9806104531a6dc74425d37448a95fecc" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "xA6EcCx5yV3sq5sJagb_J7pHX9XGOzXC" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.a2860e25.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "f15abf167ebcb6da979cb68ee9e19ffe"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.a2860e25.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.a2860e25.js"
+       source_hash            = "f15abf167ebcb6da979cb68ee9e19ffe"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.a2860e25.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "9806104531a6dc74425d37448a95fecc"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.a2860e25.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.a2860e25.js.LICENSE.txt"
+       source_hash            = "9806104531a6dc74425d37448a95fecc"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/runtime-app.431150e5.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "dbf867edc0817b845435373ac70c548c"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/runtime-app.431150e5.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/runtime-app.431150e5.js"
+       source_hash            = "dbf867edc0817b845435373ac70c548c"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/runtime-app.a5dd511e.js"] will be destroyed
  # (because key ["static/js/runtime-app.a5dd511e.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "f8bfbc4f93eeb771cbb476320a90b9b9" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/runtime-app.a5dd511e.js" -> null
-       key                    = "dist/static/js/runtime-app.a5dd511e.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/runtime-app.a5dd511e.js" -> null
-       source_hash            = "f8bfbc4f93eeb771cbb476320a90b9b9" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "hG0e.HyOETvJh9ru0vr0NWZMAvth_4ap" -> null
    }

  # module.lambda_function-cpfValidation.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-cpfValidation"
      ~ last_modified                  = "2024-02-07T20:22:49.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:16" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:16/invocations" -> (known after apply)
      ~ s3_key                         = "cpfValidation.03f26d9515a21efcc51fb0dc9cc27268.zip" -> "cpfValidation.ac5123602e6ca54dfe711dccded70004.zip"
        tags                           = {}
      ~ version                        = "16" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                = "812f212af0c7ae42eaecfb3f0c1daf901e249bbc" -> "763a5f31b37b37b64d3be26afa8108fbef765495"
              ~ "DD_TAGS"                      = "git.commit.sha:812f212af0c7ae42eaecfb3f0c1daf901e249bbc,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:763a5f31b37b37b64d3be26afa8108fbef765495,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                   = "812f212af0c7ae42eaecfb3f0c1daf901e249bbc" -> "763a5f31b37b37b64d3be26afa8108fbef765495"
                # (13 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function-cpfValidation.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "16" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-excelToJson.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-excelToJson"
      ~ last_modified                  = "2024-02-07T20:22:49.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-excelToJson:16" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-excelToJson:16/invocations" -> (known after apply)
      ~ s3_key                         = "excelToJson.f12d747e0b78b872f335428cbff9a31b.zip" -> "excelToJson.0bb9e449d8f94dcd52dcf474560e69bc.zip"
        tags                           = {}
      ~ version                        = "16" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                = "812f212af0c7ae42eaecfb3f0c1daf901e249bbc" -> "763a5f31b37b37b64d3be26afa8108fbef765495"
              ~ "DD_TAGS"                      = "git.commit.sha:812f212af0c7ae42eaecfb3f0c1daf901e249bbc,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:763a5f31b37b37b64d3be26afa8108fbef765495,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                   = "812f212af0c7ae42eaecfb3f0c1daf901e249bbc" -> "763a5f31b37b37b64d3be26afa8108fbef765495"
                # (13 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function-excelToJson.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "16" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-graphql.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-graphql"
      ~ last_modified                  = "2024-02-07T20:23:06.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:63" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:63/invocations" -> (known after apply)
      ~ s3_key                         = "graphql.1e50aff424afada973d824af9d2a113f.zip" -> "graphql.dc23bf2a4003c73c9f5cd9a7a392fe28.zip"
        tags                           = {}
      ~ version                        = "63" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                      = "812f212af0c7ae42eaecfb3f0c1daf901e249bbc" -> "763a5f31b37b37b64d3be26afa8108fbef765495"
              ~ "DD_TAGS"                            = "git.commit.sha:812f212af0c7ae42eaecfb3f0c1daf901e249bbc,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:763a5f31b37b37b64d3be26afa8108fbef765495,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                         = "812f212af0c7ae42eaecfb3f0c1daf901e249bbc" -> "763a5f31b37b37b64d3be26afa8108fbef765495"
                # (17 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.lambda_function-graphql.aws_lambda_permission.current_version_triggers["APIGateway"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "APIGateway" -> (known after apply)
      ~ qualifier           = "63" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 16 to add, 8 to change, 16 to destroy.
```

</details>

*Pusher: @Vikariusu, Action: `pull_request_target`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/cpf-reporter/actions/runs/7965739607)*